
/*
 Призы:
 Есть список “призов” с “ценой” каждого. Выглядит это как обычная таблица с ячейками с текстом и ценой.
 Есть возможность выбирать призы (отмечать ячейки чекмарками) на суммарную цену 100.
 Где-то в UI пользователь видит общую сумму, на которую выбрано призов. Каждый следующий выбор сверх лимита должен отменить выбор на необходимую сумму из первых выбранных призов.
 При этом есть возможность добавлять новые призы (кнопка “+” справа в navigation bar с переходом на экран с добавления нового приза) и удалять призы из списка (нативный свайп влево с кнопкой Delete).
 Список призов с ценами необходимо хранить в базе данных.
 Можно использовать любую архитектуру и любые доступные библиотеки. Можно расширить функционал примера по желанию, но не изменять основной сути.
 */
